Revit 2024 API
Wall.StructuralUsage Property
 Retrieves or changes the wall's designated structural usage.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public StructuralWallUsage StructuralUsage { get; set; }
Visual Basic
Public Property StructuralUsage As StructuralWallUsage
	Get
	Set
Visual C++
public:
property StructuralWallUsage StructuralUsage {
	StructuralWallUsage get ();
	void set (StructuralWallUsage value);
}
Field Value
 The wall's designated structural usage, such as bearing or non bearing.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The enum value is not invalid for StructuralWallUsage. -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Wall Class
Autodesk.Revit.DB Namespace